application/gds/travelport/requests/AirCreateReservationReq.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <AirCreateReservationReq xmlns="http://www.travelport.com/schema/universal_v33_0"
                                 TraceId="53fd748c-f6a7-443e-9685-56cdbfcebfe8" AuthorizedBy="{AUTHORIZED_BY}"
                                 TargetBranch="{TARGET_BRANCH}" ProviderCode="1G" RetainReservation="Both">
            <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v33_0" OriginApplication="UAPI"/>
            <BookingTraveler xmlns="http://www.travelport.com/schema/common_v33_0" Key="WVNaRlJJQzVtUlUyNmw3eQ=="
                             TravelerType="{TRAVELLER_TYPE}" Age="{TRAVELLER_AGE}" DOB="{TRAVELLER_DOB}" Gender="{TRAVELLER_GENDER}" Nationality="{TRAVELLER_NATIONALITY}">
                <BookingTravelerName Prefix="{TRAVELLER_PREFIX}" First="{TRAVELLER_FIRSTNAME}"
                                     Last="{TRAVELLER_LASTNAME}"/>
                <DeliveryInfo>
                    <ShippingAddress Key="1">
                        <Street>{SHIPPING_STREET}</Street>
                        <City>{SHIPPING_CITY}</City>
                        <PostalCode>{SHIPPING_POSTALCODE}</PostalCode>
                    </ShippingAddress>
                </DeliveryInfo>
                <PhoneNumber Location="{PHONE_LOCATION}" CountryCode="{PHONE_COUNTRYCODE}" AreaCode="{PHONE_AREACODE}"
                             Number="{PHONE_NUMBER}"/>
                <Email EmailID="{TRAVELLER_EMAIL}"/>
                <Address>
                    <AddressName>{ADDRESS_NAME}</AddressName>
                    <Street>{ADDRESS_STREET}</Street>
                    <City>{ADDRESS_CITY}</City>
                    <State>{ADDRESS_STATE}</State>
                    <PostalCode>{ADDRESS_POSTALCODE}</PostalCode>
                    <Country>{ADDRESS_COUNTRY}</Country>
                </Address>
            </BookingTraveler>
            <FormOfPayment xmlns="http://www.travelport.com/schema/common_v33_0" Type="Credit" Key="1">
                <CreditCard Type="{CREDITCARD_TYPE}" Number="{CREDITCARD_NUMBER}" ExpDate="{CREDITCARD_EXPDATE}"
                            Name="{CREDITCARD_NAME}" CVV="{CREDITCARD_CVV}" Key="1">
                    <BillingAddress Key="952b306d-6a05-4cb4-bfab-9b06f546d166">
                        <AddressName>{ADDRESS_NAME}</AddressName>
                        <Street>{ADDRESS_STREET}</Street>
                        <City>{ADDRESS_CITY}</City>
                        <State>{ADDRESS_STATE}</State>
                        <PostalCode>{ADDRESS_POSTALCODE}</PostalCode>
                        <Country>{ADDRESS_COUNTRY}</Country>
                    </BillingAddress>
                </CreditCard>
            </FormOfPayment>
            <AirPricingSolution xmlns="http://www.travelport.com/schema/air_v33_0" Key="jAVK7yMXRka1mFPHrp3VGw=="
                                TotalPrice="{AIR_TOTALPRICE}" BasePrice="{AIR_BASEPRICE}"
                                ApproximateTotalPrice="{AIR_APPRX_TOTALPRICE}"
                                ApproximateBasePrice="{AIR_APPRX_BASEPRICE}"
                                EquivalentBasePrice="{AIR_APPRX_BASEPRICE}" Taxes="{AIR_TAXES}">

                {AIR_SEGMENTS}

                <AirPricingInfo PricingMethod="{API_PRICING_METHOD}" Taxes="{API_TAXES}" Key="{API_KEY}"
                                TotalPrice="{API_TOTAL_PRICE}" BasePrice="{API_BASE_PRICE}" ApproximateTotalPrice="{API_APPROXIMATE_TOTAL_PRICE}"
                                ApproximateBasePrice="{API_APPROXIMATE_BASE_PRICE}" ProviderCode="{API_PROVIDER_CODE}">
                                
                    {FARE_INFOS}

                    {BOOKING_INFOS}
                    
                    <TaxInfo Key="maUnYWE3T9eetBOAjLeuxg==" Category="GB" Amount="GBP13.00"/>
                    <TaxInfo Key="SAvPd9AwQHeA6lEswcS4xw==" Category="UB" Amount="GBP12.66"/>
                    <TaxInfo Key="ikOV0ZPNS9KbeVd7//KFGA==" Category="CJ" Amount="GBP8.80"/>
                    <TaxInfo Key="+Jvta4tcT2S9h4MQqWDVow==" Category="RN" Amount="GBP10.40"/>
                    <TaxInfo Key="4vEbOHngTBuHDw33SMbcsQ==" Category="VV" Amount="GBP0.40"/>
                    
                    <PassengerType Code="ADT" Age="{TRAVELLER_AGE}" BookingTravelerRef="WVNaRlJJQzVtUlUyNmw3eQ=="/>

                </AirPricingInfo>
            </AirPricingSolution>
            <ActionStatus xmlns="http://www.travelport.com/schema/common_v33_0" Type="ACTIVE" TicketDate="T*"
                          ProviderCode="1G"/>
        </AirCreateReservationReq>
    </soapenv:Body>
</soapenv:Envelope>
